# LevelDeletedSameName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyMonitorFailures..::..LevelDeletedSameName Property
BuiltInFailures..::..CopyMonitorFailures Class See Also
---
Level cannot be copied because level with desired name '[Name]' already exist in a target document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LevelDeletedSameName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelDeletedSameName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LevelDeletedSameName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyMonitorFailures Class
Autodesk.Revit.DB Namespace